/*
Вывести на экран произведение 10 чисел от 1 до 10.
Результат - это 1 число.
Подсказка:
будет три миллиона с хвостиком.
Требования:
•	Программа должна выводить целое число на экран.
•	Метод main должен вызывать функцию System.out.println.
•	Выведенное число должно быть больше трех миллионов.
•	Выведенное число должно соответствовать заданию.
*/

public class Milliony {
    public static void main(String[] args) {
        //напишите тут ваш код
       int a=1, b=2, c=3, d=4, e=5,f=6, j=7, k=8, h=9, s=10;
        System.out.println(a*b*c*d*e*f*j*k*h*s);
    }
}
